# Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

## 1.read_csv(): This function is used to read data from a CSV file and create a pandas DataFrame.

In [4]:
df = pd.read_csv("ds_salaries.csv")

In [5]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

## 2.head(): It is used to display the first few rows of a DataFrame. By default, it shows the first five rows.

In [6]:
df.head(5)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

## 3.info(): This function provides a concise summary of a DataFrame, including the column names, data types, and the number of non-null values.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

## 4.describe(): It generates descriptive statistics of a DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values.

In [9]:
df.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

## 5.The tail() function is used to display the last few rows of a DataFrame. By default, it shows the last five rows. Here's an example of how to use the tail() function:

In [10]:
df.tail(5)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
import pandas as pd

def reindex_with_increment(df):
    # Reset the index to default (0, 1, 2, ...)
    
    df.reset_index(drop=True, inplace=True)
    new_index = pd.RangeIndex(start=1, stop=len(df) * 2, step=2)
    df.index = new_index
    
    return df

In [7]:
import pandas as pd


df = pd.DataFrame({'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

reindexed_df = reindex_with_increment(df)
print(reindexed_df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [3]:
import pandas as pd

In [4]:
def calculate_sum_of_three(df):
    data = df["values"]
    step1 = data.head(3)
    step2 = step1.sum()
    print("Sum of the first three values : " , step2)

In [6]:
step3 = {
    "values": [10,20,30,40,50]
}

df = pd.DataFrame(step3)
calculate_sum_of_three(df)

Sum of the first three values :  60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [8]:
def add_world_count(df):
    
    df["word_count"] = df["text"].apply(new)
    
def new(text):
    return len(str(text).split())


data = {
    "text":["how it is working",
           "this is another example",
           "now i am happy"]
}

df = pd.DataFrame(data)

add_world_count(df)
print(df)

                      text  word_count
0        how it is working           4
1  this is another example           4
2           now i am happy           4

# Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size():
The DataFrame.size() method returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns. It calculates the size by counting all the cells or values present in the DataFrame, regardless of their content. It returns a single integer value.

DataFrame.shape:
The DataFrame.shape attribute returns a tuple representing the dimensions of the DataFrame. It provides the number of rows and columns in the DataFrame. The shape is expressed as (number_of_rows, number_of_columns). It does not count the actual elements but gives you the structure or dimensions of the DataFrame.

To summarize, DataFrame.size() returns the total number of elements in the DataFrame, while DataFrame.shape returns the dimensions (number of rows and columns) of the DataFrame.

# Q6. Which function of pandas do we use to read an excel file?


In pandas, the function commonly used to read an Excel file is pd.read_excel(). This function allows you to read data from an Excel file and create a DataFrame.

In [14]:
df = pd.read_excel

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [3]:
import pandas as pd
def new_column(email):
    return email.split("@")[0]

pandas_data = {
    "email":["youare@gamil.com",
            "thereyougo@gamil.com",
            "allabount@gmail.com"]
}

df = pd.DataFrame(pandas_data)


df["Username"] = df["email"].apply(new_column)
print(df)

                  email    Username
0      youare@gamil.com      youare
1  thereyougo@gamil.com  thereyougo
2   allabount@gmail.com   allabount

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [7]:
def selected_row(df):
    selected_row = df[(df['A'] > '5') & (df['B'] < '10')]
    return selected_row
data={
    'A':['3','8','6','2','9'],
    'B':['5','2','9','3','1'],
    'C':['1','7','4','5','2']
}

df = pd.DataFrame(data)

output = selected_row(df)
print(output)

   A  B  C
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [1]:
import pandas as pd

In [3]:
def calculate(df):
    Mean = df['values'].mean()
    Median = df['values'].median()
    Std = df['values'].std()
    
    return Mean,Median,Std

In [4]:
data = {
    "values":[1,2,3,4,5]
}

df = pd.DataFrame(data)

Mean,Median,Std = calculate(df)

print("Mean :",Mean)
print("Median :",Median)
print("standard deviation :",Std)

Mean : 3.0
Median : 3.0
standard deviation : 1.5811388300841898

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [14]:
import pandas as pd
def Moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window = 7,min_periods = 1).mean()
    return df

database = {
    
    "Sales":[10000,11000,12000,13000,14000,15000,16000],
    "Date":["10july","11july","12july","13july","14july","15july","16july"]
}
df = pd.DataFrame(database)

df = Moving_average(df)
print(df)

   Sales    Date  MovingAverage
0  10000  10july        10000.0
1  11000  11july        10500.0
2  12000  12july        11000.0
3  13000  13july        11500.0
4  14000  14july        12000.0
5  15000  15july        12500.0
6  16000  16july        13000.0

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [4]:
import pandas as pd

def creates_new(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime("%A")
    
data = {
    "Date":["2023-07-08","2023-07-09","2023-07-10","2023-07-11","2023-07-12","2023-08-01"]
}

df = pd.DataFrame(data)

creates_new(df)
print(df)

        Date    Weekday
0 2023-07-08   Saturday
1 2023-07-09     Sunday
2 2023-07-10     Monday
3 2023-07-11    Tuesday
4 2023-07-12  Wednesday
5 2023-08-01    Tuesday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [5]:
def function(df):
    df['Date'] = pd.to_datetime(df['Date'])
    
    row = df[df['Date'].between("2023-01-01","2023-01-31")]
    return row

data = {
    "Date":['2023-01-01','2023-01-05','2023-05-12','2023-01-10','2023-03-30','2023-01-31']
}

df = pd.DataFrame(data)

output = function(df)
print(output)

        Date
0 2023-01-01
1 2023-01-05
3 2023-01-10
5 2023-01-31

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas itself.

You can import pandas using the following line of code:

In [6]:
import pandas as pd

By convention, the pandas library is commonly imported using the alias pd, which allows you to access its functions and classes conveniently using the pd prefix.